In [56]:
import pandas as pd
import numpy as np

# 1 Creating a dataframe from an array

###  1.1 Option 1

In [3]:
#creating an array
data = np.array ([[1,4], [2,5], [3,6]])

In [17]:
# creating a dataframe
pd.DataFrame(data)

   0  1
0  1  4
1  2  5
2  3  6

In [22]:
pd.DataFrame(data, index=["row1", "row2", "row3"])

      0  1
row1  1  4
row2  2  5
row3  3  6

In [23]:
pd.DataFrame(data, index=["row1", "row2", "row3"], columns = ["col1", "col2"])

      col1  col2
row1     1     4
row2     2     5
row3     3     6

In [26]:
df = pd.DataFrame(data, index=["row1", "row2", "row3"], columns = ["col1", "col2"])

In [27]:
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

### 1.2 Option 2

In [ ]:
# creating an array with list shape (parecido al otro pero solo la lista, sin numpy array)
data = ([[1,4], [2,5], [3,6]])

In [ ]:
# creating a DataFrame
pd.DataFrame(data, index=["row1", "row2", "row3"], columns = ["col1", "col2"])

In [29]:
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

# 2 Creating a DataFrame from a Dictionary

In [32]:
# lists used for this example
states= ["California", "Texas", "Florida", "New York"]
population = [39613493, 29730311, 21944577, 19299981]

In [33]:
#storing list for a dictionary
dict_states = {"States":states, "Population":population}

In [ ]:
#creating the DataFrame
pd.DataFrame(dict_states)

In [36]:
#creating the dataframe
df=pd.DataFrame(dict_states)

In [37]:
#showing the dataframe
df

       States  Population
0  California    39613493
1       Texas    29730311
2     Florida    21944577
3    New York    19299981

# 3 Creating a dataframe from a CSV file

In [60]:
# reading the csv file
pd.read_csv("StudentsPerformance.csv")

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [67]:
#defino el nombre de mi dataframe
df_exams=pd.read_csv("StudentsPerformance.csv")

In [68]:
# show 5 first rows in a dataframe
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [70]:
#show last 5
df_exams.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [73]:
df_exams.head(8)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39

In [74]:
df_exams.tail(4)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [77]:
#acceso al tamaño de los atributos, es decir nro de filas y nro de columnas
df_exams.shape

(1000, 8)

In [81]:
#
pd.set_option("display.max_rows", 80)
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86